tutorials/artery flow/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu              [0 2 -1 0 0 0 0] 0.0000038095;

rho             [1 -3 0 0 0 0 0] 1050;

sigma           [-1 -3 3 0 0 2 0] 0.7;

ku              [0 2 -1 0 0 0 0] 0.0000025714;

gu              [0 4 -1 0 0 0 0] 0.00000000000000286;

j               [0 2 0 0 0 0 0] 0.00000000075;

// ************************************************************************* //
